src/cf/Catalogs/СтандартыРазработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтандартыРазработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внешний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтандарта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Comment>Для сортировки в порядке как на сайте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСтандартаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСтандартаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСтандарт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СтандартыРазработки/Forms/ФормаСпискаСПросмотром/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПустоеСодержаниеHTML;

&НаКлиенте
Перем СодержаниеГруппыHTML;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСодержимогоСтандарта" Тогда
		СписокПриАктивизацииСтроки(Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПустоеСодержаниеHTML = "<html><head></head><body></body></html>";
	
	СодержаниеГруппыHTML =
	"<html>
	|<head>
	|	<style>H1{FONT-SIZE:18pt;FONT-FAMILY:Arial,Tahoma;FONT-WEIGHT:bold;COLOR:#003366;TEXT-ALIGN:left}
	|		.Programtext{FONT-SIZE:10pt;FONT-FAMILY:Courier New;COLOR:#000080}</style>
	|</head>
	|<body><h1>%1</h1></body>
	|</html>";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьСодержаниеСтандарта", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеСтандартаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ (ДанныеСобытия.Свойство("href") И ЗначениеЗаполнено(ДанныеСобытия.href)) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаСтандартИТС = РаботаСHTMLКлиентСервер.СсылкаНаИТС(ДанныеСобытия.Href);
	
	Если ПереходитьНаСайтИТС = Истина Тогда // открывать на сайте 1С
		
		ЗапуститьПриложениеАсинх(СсылкаНаСтандартИТС);
		
	Иначе // открывать в этой базе
		
		Стандарт = СтандартПоСсылкеИТСНаСервере(СсылкаНаСтандартИТС);
		Если ЗначениеЗаполнено(Стандарт) Тогда
			// чтобы при пееключении на элемент, расположенный выше по иерархии (не считая элементов, не групп, в корне),
			// происходила визуализация переключения. 1С не считает это ошибкой.
			Элементы.Список.ТекущаяСтрока = ПредопределенноеЗначение("Справочник.СтандартыРазработки.ПустаяСсылка");
			Элементы.Список.ТекущаяСтрока = Стандарт;
			СписокПриАктивизацииСтроки(Элементы.Список);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	СтрокаГлобальногоПоиска = "";
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"СодержаниеСтандартаТекст",
			СтрокаПоиска,
			ВидСравненияКомпоновкиДанных.Содержит);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Список.Отбор,
			"СодержаниеСтандартаТекст");
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;
	
	Если Элементы.Список.ТекущаяСтрока = ТекущаяСтрокаСписка Тогда
		РаботаСHTMLВызовСервера.ВыделитьТекстВHTML(СодержаниеСтандартаHTML, СтрокаПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	СтрокаГлобальногоПоиска = "";
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Список.Отбор,
			"СодержаниеСтандартаТекст");
	Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	
	Если Элементы.Список.ТекущаяСтрока = ТекущаяСтрокаСписка Тогда
		РаботаСHTMLВызовСервера.ВыделитьТекстВHTML(СодержаниеСтандартаHTML, СтрокаПоиска);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьPDF(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.КодСтандарта) Тогда
		Возврат;
	КонецЕсли;
	
	АдресВоВХ = ПолучитьPDFНаСервере(ТекДанные.Ссылка);
	
	Если АдресВоВХ <> Неопределено Тогда
		ИмяФайлаPDF = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ТекДанные.Наименование) + ".pdf";
		НачатьПолучениеФайлаССервера(АдресВоВХ, ИмяФайлаPDF);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаСайтеИТС(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьПриложениеАсинх(ТекДанные.СсылкаНаСтандарт);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСодержаниеСтандарта()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		СодержаниеСтандартаHTML = ПустоеСодержаниеHTML;
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаСписка = Элементы.Список.ТекущаяСтрока;
	
	ДействияСHTMLДоступны = Не ТекДанные.ЭтоГруппа;
	Элементы.ОткрытьPDF.Доступность = ДействияСHTMLДоступны;
	Если Элементы.Найти("РедактироватьСтандартHTML") <> Неопределено Тогда
		Элементы.РедактироватьСтандартHTML.Доступность = ДействияСHTMLДоступны;
	КонецЕсли;
	
	Если ТекДанные.ЭтоГруппа Тогда
		СодержаниеСтандартаHTML = СтрШаблон(СодержаниеГруппыHTML, ТекДанные.Наименование);
	Иначе
		СодержаниеСтандартаHTML = ТекДанные.СодержаниеСтандартаHTML;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаГлобальногоПоиска) Тогда
		ВыделяемыйТекст = СтрокаГлобальногоПоиска;
	Иначе
		ВыделяемыйТекст = СтрокаПоиска;
	КонецЕсли;
	РаботаСHTMLВызовСервера.ВыделитьТекстВHTML(СодержаниеСтандартаHTML, ВыделяемыйТекст);
	
КонецПроцедуры

&НаСервере
Функция СтандартПоСсылкеИТСНаСервере(СсылкаНаСтандартИТС)
	
	Возврат Справочники.СтандартыРазработки.СтандартПоСсылкеИТС(СсылкаНаСтандартИТС);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьPDFНаСервере(СсылкаНаСтандарт)
	
	ДвоичныеДанные = Справочники.СтандартыРазработки.СодержимоеСтандартаВPDFДвоичныеДанные(СсылкаНаСтандарт);
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

#КонецОбласти
